
/* Presented when user typed illegal characters -- No valid object */
"Invalid number" = "Număr invalidat";

/* Presented when user value smaller than minimum */
"Fell short of minimum" = "Nu respectă minimul";

/* Presented when user value larger than maximum */
"Maximum exceeded" = "Maximul depășit";

/* Presented when value is a float, but floats not allowed */
"Floating Point not allowed" = "Nu este permisă virgulă mobilă";

/* Presented when string cannot be converted to an NSDate */
"Invalid date string" = "Date string invalidate";

